## 🧾 Terraform Plan for `sec_backup_policy_enforcer`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backup_policy_advanced.aws_backup_plan.main_plan will be created
  + resource "aws_backup_plan" "main_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "critical_rpo_rto_plan"
      + tags     = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
      + tags_all = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
      + version  = (known after apply)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + recovery_point_tags      = {
              + "BackupFrequency" = "Weekly"
              + "Compliance"      = "SOC2"
              + "Environment"     = "Critical"
            }
          + rule_name                = "WeeklyFullBackup"
          + schedule                 = "cron(0 3 ? * SUN *)"
          + start_window             = 60
          + target_vault_name        = "critical_workloads_vault"

          + lifecycle {
              + delete_after = 180
            }
        }
      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + recovery_point_tags      = {
              + "BackupFrequency" = "Daily"
              + "Compliance"      = "SOC2"
              + "Environment"     = "Critical"
            }
          + rule_name                = "DailyBackupRule"
          + schedule                 = "cron(0 1 * * ? *)"
          + start_window             = 60
          + target_vault_name        = "critical_workloads_vault"

          + lifecycle {
              + delete_after = 90
            }
        }
    }

  # module.backup_policy_advanced.aws_backup_selection.selection_by_tags will be created
  + resource "aws_backup_selection" "selection_by_tags" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "TagBasedSelection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)

      + selection_tag {
          + key   = "Backup"
          + type  = "STRINGEQUALS"
          + value = "Enabled"
        }
    }

  # module.backup_policy_advanced.aws_backup_vault.main_vault will be created
  + resource "aws_backup_vault" "main_vault" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "critical_workloads_vault"
      + recovery_points = (known after apply)
      + tags            = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
      + tags_all        = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
    }

  # module.backup_policy_advanced.aws_backup_vault_notifications.vault_notifications[0] will be created
  + resource "aws_backup_vault_notifications" "vault_notifications" {
      + backup_vault_arn    = (known after apply)
      + backup_vault_events = [
          + "BACKUP_JOB_COMPLETED",
          + "RESTORE_JOB_COMPLETED",
        ]
      + backup_vault_name   = "critical_workloads_vault"
      + id                  = (known after apply)
      + sns_topic_arn       = "arn:aws:sns:us-east-1:123456789012:BackupNotifications"
    }

  # module.backup_policy_advanced.aws_iam_role.backup_role will be created
  + resource "aws_iam_role" "backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "critical_rpo_rto_plan_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
      + tags_all              = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
      + unique_id             = (known after apply)
    }

  # module.backup_policy_advanced.aws_iam_role_policy_attachment.backup_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "backup_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "critical_rpo_rto_plan_role"
    }

  # module.backup_policy_advanced.aws_kms_alias.backup_key_alias will be created
  + resource "aws_kms_alias" "backup_key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/critical_backup_encryption_key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.backup_policy_advanced.aws_kms_key.backup_key will be created
  + resource "aws_kms_key" "backup_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for backup vault encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
      + tags_all                           = {
          + "Compliance"  = "SOC2"
          + "Environment" = "Critical"
        }
    }

  # module.backup_policy_basic.aws_backup_plan.main_plan will be created
  + resource "aws_backup_plan" "main_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "production_backup_plan"
      + tags     = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
      + tags_all = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
      + version  = (known after apply)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + recovery_point_tags      = {
              + "BackupFrequency" = "Daily"
              + "Environment"     = "Production"
              + "Owner"           = "OpsTeam"
            }
          + rule_name                = "DailyBackupRule"
          + schedule                 = "cron(0 2 * * ? *)"
          + start_window             = 60
          + target_vault_name        = "production_backup_vault"

          + lifecycle {
              + delete_after = 35
            }
        }
    }

  # module.backup_policy_basic.aws_backup_selection.selection_by_tags will be created
  + resource "aws_backup_selection" "selection_by_tags" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "TagBasedSelection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)

      + selection_tag {
          + key   = "Backup"
          + type  = "STRINGEQUALS"
          + value = "Enabled"
        }
    }

  # module.backup_policy_basic.aws_backup_vault.main_vault will be created
  + resource "aws_backup_vault" "main_vault" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "production_backup_vault"
      + recovery_points = (known after apply)
      + tags            = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
      + tags_all        = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
    }

  # module.backup_policy_basic.aws_iam_role.backup_role will be created
  + resource "aws_iam_role" "backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "production_backup_plan_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
      + tags_all              = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
      + unique_id             = (known after apply)
    }

  # module.backup_policy_basic.aws_iam_role_policy_attachment.backup_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "backup_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "production_backup_plan_role"
    }

  # module.backup_policy_basic.aws_kms_alias.backup_key_alias will be created
  + resource "aws_kms_alias" "backup_key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/backup_vault_key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.backup_policy_basic.aws_kms_key.backup_key will be created
  + resource "aws_kms_key" "backup_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for backup vault encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
      + tags_all                           = {
          + "Environment" = "Production"
          + "Owner"       = "OpsTeam"
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->